#! /usr/bin/env python3

import rospy
from std_msgs.msg import Float32MultiArray,Bool
from geometry_msgs.msg import Twist
from sensor_msgs.msg import JointState
from dynamixel_workbench_msgs.srv import DynamixelCommandRequest,DynamixelCommand
from dynamixel_workbench_msgs.msg import DynamixelStateList,DynamixelState
import message_filters
import math
import copy
import numpy as np


# 以下は関節角が0,0の場合を0とした筋長のリスト(mmオーダー)
PI = math.pi
traj = [
	[83.60567715071024, 133.71108117914673],
	[84.71592392513624, 132.45894395133976],
	[85.80643986415087, 131.2554466840404],
	[86.87881415695607, 130.09739781427317],
	[87.93442384862131, 128.9820243833035],
	[88.97446890250168, 127.90690171897769],
	[90.00000000002065, 126.86989764578811],
	[91.01194083496883, 125.86912770906947],
	[92.01110617827693, 124.90291886214543],
	[92.9982166540249, 123.96977973567229],
	[93.97391092997114, 123.06837608341297],
	[94.93875585483063, 122.19751034090224],
	[95.89325494974003, 121.3561044830559],
	[96.83785557418618, 120.5431855393928],
	[97.77295500328805, 119.75787329789581],
	[98.69890561967551, 118.99936978821985],
	[99.61601937385042, 118.26695023828202],
	[100.52457163446115, 117.55995526317295],
	[101.42480453047132, 116.87778408275393],
	[102.31692986682447, 116.21988860569311],
	[103.20113168046385, 115.58576824712922],
	[104.07756849181162, 114.97496537062949],
	[104.94637529736305, 114.387061263977],
	[105.80766534141674, 113.8216725735571],
	[106.66153169875815, 113.27844813448105],
	[107.50804869504108, 112.75706614368276],
	[108.34727318743973, 112.25723163151268],
	[109.17924572469222, 111.77867419419651],
	[110.0039916027871, 111.32114595519542],
	[110.8215218301415, 110.88441972823398],
	[111.63183401410214, 110.46828735871611],
	[112.43491317889293, 110.0725582235738],
	[113.23073252368303, 109.6970578724005],
	[114.01925412821016, 109.34162679509802],
	[114.8004296123312, 109.00611930328697],
	[115.57420075495438, 108.69040251445851],
	[116.34050007701269, 108.39435542932132],
	[117.09925139244517, 108.11786809407016],
	[128.6572796605729, 64.07640432629357],
	[128.23544385767565, 63.97832875514431],
	[127.86365883144109, 63.79059030668396],
	[127.52143393287135, 63.54758507419436],
	[127.10916190167411, 63.40822965857705],
	[123.03670310308242, 69.01234655949438],
	[119.41850044813091, 73.89428443180083],
	[116.89211855103667, 77.05213110132405],
	[114.78571089320619, 79.54159675543819],
	[112.92069618447717, 81.64326294950664],
	[111.21755831296798, 83.48203997541499],
	[109.6326148055887, 85.1265308592285],
	[108.13880226744574, 86.61922582433616],
	[106.71797676976381, 87.98860183868223],
	[105.35727317429226, 89.25484383632242],
	[104.04717896808836, 90.43287171249737],
	[102.7804281116121, 91.5340787225972],
	[101.55132467185128, 92.56739452034554],
	[100.35530816617518, 93.53996835306003],
	[99.18866273058343, 94.45762625617705],
	[98.04831588494577, 95.32518745241663],
	[96.93169529991113, 96.14668960652814],
	[95.83662435192139, 96.92555312795753],
	[94.76124435167144, 97.66470355832172],
	[93.70395556517002, 98.36666442741158],
	[92.66337175939395, 99.03362885552602],
	[91.63828466585585, 99.66751556925169],
	[90.6276358398892, 100.27001329358357],
	[89.63049411812635, 100.84261634448467],
	[88.64603737111337, 101.38665346893055],
	[87.6735375918087, 101.90331143919872],
	[86.71234860386446, 102.3936545260386],
	[85.76189584826395, 102.85864070083863],
	[84.82166783446792, 103.29913521627256],
	[83.8912089351906, 103.71592206923775],
	[82.97011327207746, 104.10971374324843],
	[82.05801950402488, 104.48115952212756],
	[81.15460635066589, 104.8308526416105],
	[80.25958873065368, 105.15933646495614],
	[79.37271441329332, 105.46710984138222],
	[78.49376110033269, 105.75463177753339],
	[77.62253387053823, 106.0223255270459],
	[76.75886293153728, 106.2705821846863],
	[83.60567715071024, 133.71108117914673],
	[84.71592392513624, 132.45894395133976],
	[85.80643986415087, 131.2554466840404],
	[86.87881415695607, 130.09739781427317],
	[87.93442384862131, 128.9820243833035],
	[88.97446890250168, 127.90690171897769],
	[90.00000000002065, 126.86989764578811],
	[91.01194083496883, 125.86912770906947],
	[92.01110617827693, 124.90291886214543],
	[92.9982166540249, 123.96977973567229],
	[93.97391092997114, 123.06837608341297],
	[94.93875585483063, 122.19751034090224],
	[95.89325494974003, 121.3561044830559],
	[96.83785557418618, 120.5431855393928],
	[97.77295500328805, 119.75787329789581],
	[98.69890561967551, 118.99936978821985],
	[99.61601937385042, 118.26695023828202],
	[100.52457163446115, 117.55995526317295],
	[101.42480453047132, 116.87778408275393],
	[102.31692986682447, 116.21988860569311],
	[103.20113168046385, 115.58576824712922],
	[104.07756849181162, 114.97496537062949],
	[104.94637529736305, 114.387061263977],
	[105.80766534141674, 113.8216725735571],
	[106.66153169875815, 113.27844813448105],
	[107.50804869504108, 112.75706614368276],
	[108.34727318743973, 112.25723163151268],
	[109.17924572469222, 111.77867419419651],
	[110.0039916027871, 111.32114595519542],
	[110.8215218301415, 110.88441972823398],
	[111.63183401410214, 110.46828735871611],
	[112.43491317889293, 110.0725582235738],
	[113.23073252368303, 109.6970578724005],
	[114.01925412821016, 109.34162679509802],
	[114.8004296123312, 109.00611930328697],
	[115.57420075495438, 108.69040251445851],
	[116.34050007701269, 108.39435542932132],
	[117.09925139244517, 108.11786809407016]
]
traj = np.array(traj)
traj /= 14 #mmをプーリ半径mmで割ってradに変換
#2軸の角度変化のうち大きい方を基準角速度で割って、基準補完時間とする
#基準関節角速度はT-ω図の真ん中あたり
std_omega = 40*(2*PI/60) #[rad/s]

#traj2[i]に、traj[i-1]からtraj[i]へのstd_omgによる到達時間を入れたい. traj2[0]については、trajの末尾からtrajの先頭に戻るときの所要時間を入れたい
itpl_times = []
for i in range(traj.shape[0]):
    t_cur=traj[i]
    t_prev=traj[(i-1)%traj.shape[0]]
    itpl_time = np.max(np.abs(t_prev-t_cur))/std_omega
    if len(itpl_times)==0:
        itpl_times.append(itpl_time)
    else:
        itpl_times.append(itpl_time+itpl_times[-1])

traj2 = np.hstack((traj,np.array(itpl_times).reshape((traj.shape[0],1))))
traj2 = np.vstack((np.array([traj[-1][0],traj[-1][1],0]).reshape(1,3),traj2))

## traj2を時間データに対してスプライン補完 床接触時の多少の高さ誤差は無視
from scipy import interpolate
f0 = np.vectorize(interpolate.Akima1DInterpolator(traj2[:,2],traj2[:,0]))
f1 = np.vectorize(interpolate.Akima1DInterpolator(traj2[:,2],traj2[:,1]))
# f0,f1に標準時間を与えれば関節角度を返してくれる.
std_nt_tm = traj2[-1,2] #標準総時間




class pos_controller():
    def __init__(self):
        ##↓member_params↓##
        self.n = 8
        self.ids = [0,1,2,3,4,5,6,7]
        # joint id and servo id relation
        # 0:l_knee,1:l_shoulder,2:r_shoulder,3:r_knee
        self.joints = {0:[0,4],1:[1,5],2:[3,7],3:[2,6]}
        #joint id と　それへの関節角指令を入れる辞書変数
        self.joint_cmd = {0:0,1:0,2:0,3:0}
        #standard_vel
        self.std_vel= 0.01
        #physical params
        self.rad = 0.12 #旋回半径

        #rate
        self.rate_left = 1
        self.rate_right = 1
        self.dynamixel_states = []
        ##↑member_params↑##
        rospy.init_node("pos_controller")
        rospy.Subscriber("/cmd_vel",Twist,self.callback)
        # これだけでsubscribeは開始される
        rospy.Subscriber("/dynamixel_workbench/dynamixel_state",DynamixelStateList,self.callback2)
    
    def callback(self,cv_rb=Twist()):
        # 左右の時間rateを算出・保存するやつ
        # UI側でcmd_velは一旦ang.zとlin.xに限定している.
        vel = cv_rb.linear.x
        omg = cv_rb.angular.z

        self.rate_left = (vel-self.rad*omg)/self.std_vel
        self.rate_right = (vel+self.rad*omg)/self.std_vel
    def callback2(self,msg=DynamixelStateList()):
        msg=sorted(list(msg.dynamixel_state),key=lambda x:x.id)
        self.dynamixel_states = msg



    def jnt_ctl(self):
        # self.jointsの値をサーボに反映する。
        ## joint_cmdに指示する角度値をサーボの角度に変換する必要がある。線形関係が成り立っているため、coef*jonit+ofst = mt というa,bのリストを持てば良い
        ##各ジョイントに使われる各々サーボについて、その値は共通とする。
        coefs = {0:-1,1:-1,2:-1,3:+1}
        ofsts = {0:6.33,1:9.15,2:6.413,3:-2.47} #[rad]
        ##サービス"dynamixel_command"を関数として読み込む
        rospy.wait_for_service("/dynamixel_workbench/dynamixel_command")
        dmx_cmd = rospy.ServiceProxy("/dynamixel_workbench/dynamixel_command",DynamixelCommand)
        for i in range(4):
            ### 各サーボについて指令を送る。
            jnt_ang=self.joint_cmd[i]
            mot_ang=coefs[i]*jnt_ang+ofsts[i]
            cmd = DynamixelCommandRequest()
            cmd.command = ""
            #指令用メッセージオブジェクト

            ## まずはメインサーボに位置指令
            cmd.id = self.joints[i][0]
            cmd.addr_name="Goal_Position"
            cmd.value = int(mot_ang*(4096/(2*PI))) # 指令値は0~4096のint
            #指令
            dmx_cmd(cmd)
            ## さらにメインサーボから電流を取得
            continue
            if self.dynamixel_states!=[]:
                current = self.dynamixel_states[self.joints[i][0]].present_current
                cmd.id = self.joints[i][1]
                cmd.addr_name="Goal_Current"
                cmd.value = -current
                ### 取得した値は実電流/scale_factorなので、そのまま指令に使える
                ### ギア同期なので正負反転
                dmx_cmd(cmd)
            else:
                pass


#loopの途中で止まっちゃってる！！！            

    def loop(self):
        tm_rate = 100
        clk_ct_l = 0
        clk_ct_r = std_nt_tm/2
        # clk_ctはtraj_smthの基準時間（つまり三列目）を指し示す
        # 位相を保存したいが、一旦その機能はなしでいいかな。面倒くさいから...
        Rate = rospy.Rate(tm_rate)
        rospy.loginfo("loop start")
        while not rospy.is_shutdown():
            rospy.loginfo("on the loop")
            clk_ct_l = (clk_ct_l+(1/tm_rate)*(self.rate_left))%std_nt_tm
            clk_ct_r = (clk_ct_r+(1/tm_rate)*(self.rate_right))%std_nt_tm
            self.joint_cmd[1],self.joint_cmd[0] = f0(clk_ct_l),f1(clk_ct_l)
            self.joint_cmd[2],self.joint_cmd[3] = f0(clk_ct_r),f1(clk_ct_r)
            self.jnt_ctl()
            Rate.sleep()

if __name__ == "__main__":
    obj = pos_controller()
    obj.loop()
            
